Revit 2026 API

# CheckerTextureOffsetLock Property

---

The property labeled "Offset Lock" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureOffsetLock { get; }
```
```vb
Public Shared ReadOnly Property TextureOffsetLock As String
	Get
```
```cpp
public:
static property String^ TextureOffsetLock {
	String^ get ();
}
```
```fsharp
static member TextureOffsetLock : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace